publish/4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-26 Thu 22:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weekly#4</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Weekly#4</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4d4231c">News | Article</a>
<ul>
<li><a href="#org1941e79">The Book of Secret Knowledge</a></li>
<li><a href="#orgd4594f6">How to avoid losing items? Holding pens.</a></li>
<li><a href="#org9a2f6e6">How I Created 175 Fonts Using Rust</a></li>
<li><a href="#orga07175c">Learn things that don't change</a></li>
<li><a href="#org496f193">Obvious travel advice</a></li>
<li><a href="#org34eb917">ECMAScript Safe Assignment Operator Proposal</a></li>
</ul>
</li>
<li><a href="#org69a33b4">Tutorial</a>
<ul>
<li><a href="#orge1a1f99">Vue3 编译原理揭秘</a></li>
<li><a href="#org735e755">PDF Explained （译作《PDF 解析》）</a></li>
<li><a href="#org9fda129">Learn Lit</a></li>
<li><a href="#org665e3b5">Learn web components</a></li>
</ul>
</li>
<li><a href="#org8c9db15">Code</a>
<ul>
<li><a href="#orgc4881a0">One Thing Nobody Explained To You About TypeScript</a></li>
<li><a href="#org62d6979">Common Causes of Memory Leaks in JavaScript</a></li>
<li><a href="#orga9dbec7">Patterns for Memory Efficient DOM Manipulation with Modern Vanilla JavaScript</a></li>
<li><a href="#org45fd977">Transition to `height: auto` &amp; `display: none` Using Pure CSS</a></li>
<li><a href="#org5bac3a6">CSS Grid Areas</a></li>
<li><a href="#orgff1a46b">Zoom, zoom, and zoom (The three types of browser (and CSS!) magnification)</a></li>
</ul>
</li>
<li><a href="#orgc9c1498">Cool Bit</a>
<ul>
<li><a href="#org8066caa">3D Bookshelf</a></li>
</ul>
</li>
<li><a href="#org2d8f943">Tool | Library</a>
<ul>
<li><a href="#org9b12d83">Icon Maker</a></li>
<li><a href="#org6027a66">Gradient Generator – CSS &amp; SVG Export</a></li>
</ul>
</li>
<li><a href="#org1f0bf75">Music</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4d4231c" class="outline-2">
<h2 id="org4d4231c">News | Article</h2>
<div class="outline-text-2" id="text-org4d4231c">
</div>
<div id="outline-container-org1941e79" class="outline-3">
<h3 id="org1941e79"><a href="https://github.com/trimstray/the-book-of-secret-knowledge">The Book of Secret Knowledge</a></h3>
<div class="outline-text-3" id="text-org1941e79">
<p>
一个收集了很多东西的 awesome-list, 包括 CLI 工具，GUI 工具，Web 工具，网络，容器，博客，黑客，Shell 等相关的内容。
</p>
</div>
</div>

<div id="outline-container-orgd4594f6" class="outline-3">
<h3 id="orgd4594f6"><a href="https://blog.alexwendland.com/2024-07-07-holding-pens/">How to avoid losing items? Holding pens.</a></h3>
<div class="outline-text-3" id="text-orgd4594f6">
<p>
你会不会经常忘了东西放在哪？
</p>

<p>
可能是因为东西随手一放，没有放在特定的地方，再次找的时候就忘了之前放在哪了。
</p>

<p>
理想情况下就是总是把东西放回原来的地方，那么每次都去相同地方找就好了，但有时可能放的地方远，拿过去麻烦又放弃了。
</p>

<p>
作者建议在每个区域放一个专门用于放杂物的，提供一个集中的，轻松的放置点，定期清理，从而避免忘记东西在哪。
</p>
</div>
</div>

<div id="outline-container-org9a2f6e6" class="outline-3">
<h3 id="org9a2f6e6"><a href="https://chevyray.dev/blog/creating-175-fonts/">How I Created 175 Fonts Using Rust</a></h3>
<div class="outline-text-3" id="text-org9a2f6e6">
<p>
作者使用 Rust 创建 175 种字体的过程。
</p>
</div>
</div>

<div id="outline-container-orga07175c" class="outline-3">
<h3 id="orga07175c"><a href="https://newsletter.techworld-with-milan.com/p/learn-things-that-dont-change">Learn things that don't change</a></h3>
<div class="outline-text-3" id="text-orga07175c">
<p>
作者推荐了 <a href="https://newsletter.techworld-with-milan.com/i/144462358/books-every-software-engineer-must-read-in">24 本程序员应该一读的书</a>，涉及到基础，算法，分布式系统，领导力，代码最佳实践，数据库，DevOps，高效工作，测试，架构，机器学习。
</p>
</div>
</div>

<div id="outline-container-org496f193" class="outline-3">
<h3 id="org496f193"><a href="https://dynomight.net/travel/">Obvious travel advice</a></h3>
<div class="outline-text-3" id="text-org496f193">
<p>
作者的一些旅行建议和看法：
</p>

<ul class="org-ul">
<li>和谁一起去比去哪里更重要。</li>
<li>人在喝了液体后必须要小便。所以如果你即将去一个无法小便的地方，也许不要喝太多液体。</li>
<li>公交车上的风景比地铁有趣得多。</li>
<li>旅行揭示了稳定、根基、日常生活、社区、人际关系和家庭烹饪的价值。</li>
<li>&#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-org34eb917" class="outline-3">
<h3 id="org34eb917"><a href="https://github.com/arthurfiorette/proposal-safe-assignment-operator">ECMAScript Safe Assignment Operator Proposal</a></h3>
<div class="outline-text-3" id="text-org34eb917">
<p>
Safe Assignment Operator:
</p>

<pre class="example" id="orga807fa4">
const [error, response] ?= await fetch("https://arthur.place")
</pre>

<p>
有了 <code>?=</code> ，用 await 的时候就不用写很长的 try&#x2026;catch&#x2026; 处理了，也不用嵌套 try&#x2026;catch&#x2026; 处理一些错误，代码阅读下来整体会简洁清晰一些。
</p>

<p>
期待这个操作符正式加入规范。
</p>
</div>
</div>
</div>

<div id="outline-container-org69a33b4" class="outline-2">
<h2 id="org69a33b4">Tutorial</h2>
<div class="outline-text-2" id="text-org69a33b4">
</div>
<div id="outline-container-orge1a1f99" class="outline-3">
<h3 id="orge1a1f99"><a href="https://vue-compiler.iamouyang.cn/">Vue3 编译原理揭秘</a></h3>
<div class="outline-text-3" id="text-orge1a1f99">
<blockquote>
<p>
通过 debug 的方式带你搞清楚 Vue3 中的编译黑魔法。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org735e755" class="outline-3">
<h3 id="org735e755"><a href="https://zxyle.github.io/PDF-Explained/">PDF Explained （译作《PDF 解析》）</a></h3>
<div class="outline-text-3" id="text-org735e755">
<p>
一本解释 PDF 格式的小册子。
</p>

<p>
之前做一个需求，需要将页面打印成 PDF。
</p>

<p>
页面转换的 PDF 打印后，和从设计稿导出的 PDF 打印比较，发现字体存在差异， 设计稿的字体比页面实现的看起来更大一些， 页面的一些高度也不对。
</p>

<p>
排除了不是页面样式实现问题后，猜测可能是设计稿导出的 PDF 有什么不一样。
</p>

<p>
比较了两份 PDF，页面实现的是 type0 字体，PDF 中内嵌了 font-family 指定的字体。
</p>

<p>
而设计稿导出的 PDF 是 type3 字体，相比 type0，可以实现更复杂的样式，但是实际打印可能不如 type0 兼容性好。
</p>

<p>
目前还不是很确定是不是字体原因，后续如果弄明白了再写篇博客整理一下。
</p>
</div>
</div>

<div id="outline-container-org9fda129" class="outline-3">
<h3 id="org9fda129"><a href="https://lit.how/">Learn Lit</a></h3>
<div class="outline-text-3" id="text-org9fda129">
<p>
一个介绍 <a href="https://github.com/lit/lit/">Lit</a> 基本使用的网站，Lit 是用来构建 web components 的库。
</p>
</div>
</div>

<div id="outline-container-org665e3b5" class="outline-3">
<h3 id="org665e3b5"><a href="https://learn-wcs.com/">Learn web components</a></h3>
<div class="outline-text-3" id="text-org665e3b5">
<p>
一个 web components 教程，介绍了开发 web components 需要涉及的相关知识。
</p>
</div>
</div>
</div>

<div id="outline-container-org8c9db15" class="outline-2">
<h2 id="org8c9db15">Code</h2>
<div class="outline-text-2" id="text-org8c9db15">
</div>
<div id="outline-container-orgc4881a0" class="outline-3">
<h3 id="orgc4881a0"><a href="https://kettanaito.com/blog/one-thing-nobody-explained-to-you-about-typescript">One Thing Nobody Explained To You About TypeScript</a></h3>
<div class="outline-text-3" id="text-orgc4881a0">
<p>
作者指出了 <code>tsconfig.json</code> 中 <code>include</code> 字段理解上的一些误解。
</p>

<blockquote>
<p>
The include option controls what modules to apply this TypeScript configuration to.
</p>
</blockquote>

<p>
<code>include</code> 字段指的是 tsconfig.json 对什么文件起作用，但是如果这里面包含的文件比较多，有时候可能会出现一些意外的类型。
</p>

<p>
例如开发时只希望提示 src 中文件的类型，但是如果 include 了 test 目录，可能在开发时会出现 test 目录的类型。
</p>

<p>
相当于将 test 目录中的类型，泄露到了 src 目录中。
</p>

<p>
当在 src 中编写了一个不存在于 src 的类型，但是存在 test 中，就不会报错，这可能并不是想要的表现。
</p>

<p>
解决办法就是针对不同目录，使用不同的 tsconfig.json ，然后通过 <code>reference</code> 字段链接不同目录的 tsconfig.json 。
</p>
</div>
</div>

<div id="outline-container-org62d6979" class="outline-3">
<h3 id="org62d6979"><a href="https://www.trevorlasn.com/blog/common-causes-of-memory-leaks-in-javascript">Common Causes of Memory Leaks in JavaScript</a></h3>
<div class="outline-text-3" id="text-org62d6979">
<p>
一些常见的造成 JS 内存泄露的场景。
</p>
</div>
</div>

<div id="outline-container-orga9dbec7" class="outline-3">
<h3 id="orga9dbec7"><a href="https://frontendmasters.com/blog/patterns-for-memory-efficient-dom-manipulation/">Patterns for Memory Efficient DOM Manipulation with Modern Vanilla JavaScript</a></h3>
<div class="outline-text-3" id="text-orga9dbec7">
<p>
一些操作 DOM 的高效的技巧，这些技巧的性能损耗相对比较小。
</p>
</div>
</div>

<div id="outline-container-org45fd977" class="outline-3">
<h3 id="org45fd977"><a href="https://blog.css-weekly.com/transition-to-height-auto-display-none-using-pure-css?utm_source=CSS-Weekly&amp;utm_campaign=Issue-589&amp;utm_medium=web">Transition to `height: auto` &amp; `display: none` Using Pure CSS</a></h3>
<div class="outline-text-3" id="text-org45fd977">
<p>
你有没有碰到过对 <code>height:auto</code> 和 <code>display: none</code> ，设置了 transition 实现过渡效果，但是不生效？
</p>

<p>
作者介绍了两个较新的 CSS 语法， <code>calc-size</code> 和 <code>interpolate-size</code> 来解决，同时也提供了 JavaScript 实现的替代方法。
</p>
</div>
</div>

<div id="outline-container-org5bac3a6" class="outline-3">
<h3 id="org5bac3a6"><a href="https://ishadeed.com/article/css-grid-area">CSS Grid Areas</a></h3>
<div class="outline-text-3" id="text-org5bac3a6">
<p>
当使用 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_grid_layout">grid</a> 布局的时候，需要将元素放到对应的格子中，一种办法是指定对应的 column 和 row，但数起来会比较麻烦。
</p>

<p>
作者推荐使用 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/grid-area">grid-area</a>，通过区域指定位置，文中讲了作者使用 area 的技巧。
</p>
</div>
</div>

<div id="outline-container-orgff1a46b" class="outline-3">
<h3 id="orgff1a46b"><a href="https://www.oddbird.net/2024/07/09/zoomies/">Zoom, zoom, and zoom (The three types of browser (and CSS!) magnification)</a></h3>
<div class="outline-text-3" id="text-orgff1a46b">
<p>
文章介绍了浏览器三种缩放方式对于页面的影响。
</p>
</div>
</div>
</div>

<div id="outline-container-orgc9c1498" class="outline-2">
<h2 id="orgc9c1498">Cool Bit</h2>
<div class="outline-text-2" id="text-orgc9c1498">
</div>
<div id="outline-container-org8066caa" class="outline-3">
<h3 id="org8066caa"><a href="https://github.com/mawise/bookshelf">3D Bookshelf</a></h3>
<div class="outline-text-3" id="text-org8066caa">
<p>
作者给他的电子书做了一个 3D 电子书架。
</p>

<p>
好看是好看，但找起来还是不如看书的封面来得快。
</p>
</div>
</div>
</div>

<div id="outline-container-org2d8f943" class="outline-2">
<h2 id="org2d8f943">Tool | Library</h2>
<div class="outline-text-2" id="text-org2d8f943">
</div>
<div id="outline-container-org9b12d83" class="outline-3">
<h3 id="org9b12d83"><a href="https://ray.so/icon">Icon Maker</a></h3>
<div class="outline-text-3" id="text-org9b12d83">
<p>
Raycast 提供的一个 Icon 制作工具。
</p>
</div>
</div>

<div id="outline-container-org6027a66" class="outline-3">
<h3 id="org6027a66"><a href="https://www.learnui.design/tools/gradient-generator.html?ck_subscriber_id=2572000771">Gradient Generator – CSS &amp; SVG Export</a></h3>
<div class="outline-text-3" id="text-org6027a66">
<p>
渐变色生成器，可以导出 CSS，功能很丰富。
</p>
</div>
</div>
</div>

<div id="outline-container-org1f0bf75" class="outline-2">
<h2 id="org1f0bf75">Music</h2>
<div class="outline-text-2" id="text-org1f0bf75">
<p>
本周推荐一个日本的爵士钢琴家: <a href="https://music.163.com/#/artist?id=30107605">福居良(Ryo Fukui)</a>，他的爵士钢琴感觉比较容易欣赏。
</p>

<p>
类比的话，就像是听古典钢琴曲和久石让宫崎骏动画钢琴曲的差别，前者需要比较高的鉴赏能力，后者光是旋律就很抓耳，容易听下去。
</p>

<p>
福居良的爵士钢琴，就像是久石让那些动画钢琴曲一样，会让我很轻松地欣赏，反反复复地听。
</p>

<p>
他的所有专辑都推荐一听，其中我听的最多的是 《<a href="https://music.163.com/#/song?id=1313897920">My Back Pages(Live)</a>》，整首曲子近 19 分钟，但是听起来一点不枯燥，当钢琴旋律流动时，果断点击红心收藏了。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: Spike Leung (<a href="mailto:l-yanlei@hotmail.com">l-yanlei@hotmail.com</a>)</p>
<p class="date">Date: 2024-08-17 Sat 00:00</p>
</div>
</body>
</html>
